# generated by get_cup_sdc.py
# Date: 2023/03/02

#------------------------------------------#
# Pre-defined Constraints
#------------------------------------------#

# Clock network
if {[info exists ::env(CLOCK_PORT)] && $::env(CLOCK_PORT) != ""} {
	set clk_input $::env(CLOCK_PORT)
	create_clock [get_ports $clk_input] -name clk -period $::env(CLOCK_PERIOD)
	puts "\[INFO\]: Creating clock {clk} for port $clk_input with period: $::env(CLOCK_PERIOD)"
} else {
	set clk_input __VIRTUAL_CLK__
	create_clock -name clk -period $::env(CLOCK_PERIOD)
	puts "\[INFO\]: Creating virtual clock with period: $::env(CLOCK_PERIOD)"
}
if { ![info exists ::env(SYNTH_CLK_DRIVING_CELL)] } {
	set ::env(SYNTH_CLK_DRIVING_CELL) $::env(SYNTH_DRIVING_CELL)
}
if { ![info exists ::env(SYNTH_CLK_DRIVING_CELL_PIN)] } {
	set ::env(SYNTH_CLK_DRIVING_CELL_PIN) $::env(SYNTH_DRIVING_CELL_PIN)
}

# Clock non-idealities
set_propagated_clock [get_clocks {clk}]
set_clock_uncertainty 0.1 [get_clocks {clk}]
puts "\[INFO\]: Setting clock uncertainity to: 0.1"
set_clock_transition $::env(SYNTH_CLOCK_TRANSITION) [get_clocks {clk}]
puts "\[INFO\]: Setting clock transition to: $::env(SYNTH_CLOCK_TRANSITION)"

# Maximum transition time of the design nets
set_max_transition 1.5 [current_design]
puts "\[INFO\]: Setting maximum transition to: 1.5"

# Maximum fanout
set_max_fanout 20 [current_design]
puts "\[INFO\]: Setting maximum fanout to: 20"

# Timing paths delays derate
set_timing_derate -early [expr {1-$::env(SYNTH_TIMING_DERATE)}]
set_timing_derate -late [expr {1+$::env(SYNTH_TIMING_DERATE)}]
puts "\[INFO\]: Setting timing derate to: [expr {$::env(SYNTH_TIMING_DERATE) * 100}] %"

#------------------------------------------#
# Retrieved Constraints
#------------------------------------------#

# Clock source latency
set usr_clk_max_latency 4.7
set usr_clk_min_latency 4.24
set clk_max_latency 6
set clk_min_latency 4.5
set_clock_latency -source -max $clk_max_latency [get_clocks {clk}]
set_clock_latency -source -min $clk_min_latency [get_clocks {clk}]
puts "\[INFO\]: Setting clock latency range: $clk_min_latency : $clk_max_latency"

# Clock input Transition
set usr_clk_tran 0.11
set clk_tran 0.6
set_input_transition $clk_tran [get_ports $clk_input]
puts "\[INFO\]: Setting clock transition: $clk_tran"

# Input delays
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wb_rst_i}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[10]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[11]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[12]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[13]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[14]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[15]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[16]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[17]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[18]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[19]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[20]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[21]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[22]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[23]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[24]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[25]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[26]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[27]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[28]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[29]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[2]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[30]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[31]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[3]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[4]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[5]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[6]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[7]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[8]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[9]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_cyc_i}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[0]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[10]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[11]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[12]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[13]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[14]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[15]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[16]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[17]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[18]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[19]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[1]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[20]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[21]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[22]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[23]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[24]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[25]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[26]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[27]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[28]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[29]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[2]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[30]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[31]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[3]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[4]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[5]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[6]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[7]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[8]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[9]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_sel_i[0]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_sel_i[1]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_sel_i[2]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_sel_i[3]}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_stb_i}]
set_input_delay -max 6   -clock [get_clocks {clk}] [get_ports {wbs_we_i}]
set_input_delay -min 1.90   -clock [get_clocks {clk}] [get_ports {wb_rst_i}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[10]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[11]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[12]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[13]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[14]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[15]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[16]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[17]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[18]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[19]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[20]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[21]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[22]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[23]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[24]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[25]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[26]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[27]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[28]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[29]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[2]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[30]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[31]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[3]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[4]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[5]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[6]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[7]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[8]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_adr_i[9]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_cyc_i}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[0]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[10]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[11]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[12]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[13]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[14]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[15]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[16]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[17]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[18]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[19]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[1]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[20]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[21]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[22]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[23]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[24]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[25]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[26]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[27]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[28]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[29]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[2]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[30]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[31]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[3]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[4]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[5]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[6]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[7]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[8]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_i[9]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_sel_i[0]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_sel_i[1]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_sel_i[2]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_sel_i[3]}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_stb_i}]
set_input_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_we_i}]

# Input Transition
set_input_transition -min 1.05  [get_ports {wb_rst_i}]
set_input_transition -min 1.05  [get_ports {wbs_adr_i[10]}]
set_input_transition -min 1.05  [get_ports {wbs_adr_i[11]}]
set_input_transition -min 1.05  [get_ports {wbs_adr_i[12]}]
set_input_transition -min 1.05  [get_ports {wbs_adr_i[13]}]
set_input_transition -min 1.05  [get_ports {wbs_adr_i[14]}]
set_input_transition -min 1.05  [get_ports {wbs_adr_i[15]}]
set_input_transition -min 1.05  [get_ports {wbs_adr_i[16]}]
set_input_transition -min 1.05  [get_ports {wbs_adr_i[17]}]
set_input_transition -min 1.05  [get_ports {wbs_adr_i[18]}]
set_input_transition -min 1.05  [get_ports {wbs_adr_i[19]}]
set_input_transition -min 1.05  [get_ports {wbs_adr_i[20]}]
set_input_transition -min 1.05  [get_ports {wbs_adr_i[21]}]
set_input_transition -min 1.05  [get_ports {wbs_adr_i[22]}]
set_input_transition -min 1.05  [get_ports {wbs_adr_i[23]}]
set_input_transition -min 1.05  [get_ports {wbs_adr_i[24]}]
set_input_transition -min 1.05  [get_ports {wbs_adr_i[25]}]
set_input_transition -min 1.05  [get_ports {wbs_adr_i[26]}]
set_input_transition -min 1.05  [get_ports {wbs_adr_i[27]}]
set_input_transition -min 1.05  [get_ports {wbs_adr_i[28]}]
set_input_transition -min 1.05  [get_ports {wbs_adr_i[29]}]
set_input_transition -min 1.05  [get_ports {wbs_adr_i[2]}]
set_input_transition -min 1.05  [get_ports {wbs_adr_i[30]}]
set_input_transition -min 1.05  [get_ports {wbs_adr_i[31]}]
set_input_transition -min 1.05  [get_ports {wbs_adr_i[3]}]
set_input_transition -min 1.05  [get_ports {wbs_adr_i[4]}]
set_input_transition -min 1.05  [get_ports {wbs_adr_i[5]}]
set_input_transition -min 1.05  [get_ports {wbs_adr_i[6]}]
set_input_transition -min 1.05  [get_ports {wbs_adr_i[7]}]
set_input_transition -min 1.05  [get_ports {wbs_adr_i[8]}]
set_input_transition -min 1.05  [get_ports {wbs_adr_i[9]}]
set_input_transition -min 1.05  [get_ports {wbs_cyc_i}]
set_input_transition -min 1.05  [get_ports {wbs_dat_i[0]}]
set_input_transition -min 1.05  [get_ports {wbs_dat_i[10]}]
set_input_transition -min 1.05  [get_ports {wbs_dat_i[11]}]
set_input_transition -min 1.05  [get_ports {wbs_dat_i[12]}]
set_input_transition -min 1.05  [get_ports {wbs_dat_i[13]}]
set_input_transition -min 1.05  [get_ports {wbs_dat_i[14]}]
set_input_transition -min 1.05  [get_ports {wbs_dat_i[15]}]
set_input_transition -min 1.05  [get_ports {wbs_dat_i[16]}]
set_input_transition -min 1.05  [get_ports {wbs_dat_i[17]}]
set_input_transition -min 1.05  [get_ports {wbs_dat_i[18]}]
set_input_transition -min 1.05  [get_ports {wbs_dat_i[19]}]
set_input_transition -min 1.05  [get_ports {wbs_dat_i[1]}]
set_input_transition -min 1.05  [get_ports {wbs_dat_i[20]}]
set_input_transition -min 1.05  [get_ports {wbs_dat_i[21]}]
set_input_transition -min 1.05  [get_ports {wbs_dat_i[22]}]
set_input_transition -min 1.05  [get_ports {wbs_dat_i[23]}]
set_input_transition -min 1.05  [get_ports {wbs_dat_i[24]}]
set_input_transition -min 1.05  [get_ports {wbs_dat_i[25]}]
set_input_transition -min 1.05  [get_ports {wbs_dat_i[26]}]
set_input_transition -min 1.05  [get_ports {wbs_dat_i[27]}]
set_input_transition -min 1.05  [get_ports {wbs_dat_i[28]}]
set_input_transition -min 1.05  [get_ports {wbs_dat_i[29]}]
set_input_transition -min 1.05  [get_ports {wbs_dat_i[2]}]
set_input_transition -min 1.05  [get_ports {wbs_dat_i[30]}]
set_input_transition -min 1.05  [get_ports {wbs_dat_i[31]}]
set_input_transition -min 1.05  [get_ports {wbs_dat_i[3]}]
set_input_transition -min 1.05  [get_ports {wbs_dat_i[4]}]
set_input_transition -min 1.05  [get_ports {wbs_dat_i[5]}]
set_input_transition -min 1.05  [get_ports {wbs_dat_i[6]}]
set_input_transition -min 1.05  [get_ports {wbs_dat_i[7]}]
set_input_transition -min 1.05  [get_ports {wbs_dat_i[8]}]
set_input_transition -min 1.05  [get_ports {wbs_dat_i[9]}]
set_input_transition -min 1.05  [get_ports {wbs_sel_i[0]}]
set_input_transition -min 1.05  [get_ports {wbs_sel_i[1]}]
set_input_transition -min 1.05  [get_ports {wbs_sel_i[2]}]
set_input_transition -min 1.05  [get_ports {wbs_sel_i[3]}]
set_input_transition -min 1.05  [get_ports {wbs_stb_i}]
set_input_transition -min 1.05  [get_ports {wbs_we_i}]

# Output delays
set_output_delay -max 8.00   -clock [get_clocks {clk}] [get_ports {wbs_ack_o}]
set_output_delay -max 8.00   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[0]}]
set_output_delay -max 8.00   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[10]}]
set_output_delay -max 8.00   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[11]}]
set_output_delay -max 8.00   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[12]}]
set_output_delay -max 8.00   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[13]}]
set_output_delay -max 8.00   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[14]}]
set_output_delay -max 8.00   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[15]}]
set_output_delay -max 8.00   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[16]}]
set_output_delay -max 8.00   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[17]}]
set_output_delay -max 8.00   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[18]}]
set_output_delay -max 8.00   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[19]}]
set_output_delay -max 8.00   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[1]}]
set_output_delay -max 8.00   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[20]}]
set_output_delay -max 8.00   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[21]}]
set_output_delay -max 8.00   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[22]}]
set_output_delay -max 8.00   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[23]}]
set_output_delay -max 8.00   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[24]}]
set_output_delay -max 8.00   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[25]}]
set_output_delay -max 8.00   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[26]}]
set_output_delay -max 8.00   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[27]}]
set_output_delay -max 8.00   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[28]}]
set_output_delay -max 8.00   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[29]}]
set_output_delay -max 8.00   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[2]}]
set_output_delay -max 8.00   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[30]}]
set_output_delay -max 8.00   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[31]}]
set_output_delay -max 8.00   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[3]}]
set_output_delay -max 8.00   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[4]}]
set_output_delay -max 8.00   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[5]}]
set_output_delay -max 8.00   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[6]}]
set_output_delay -max 8.00   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[7]}]
set_output_delay -max 8.00   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[8]}]
set_output_delay -max 8.00   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[9]}]
set_output_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_ack_o}]
set_output_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[0]}]
set_output_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[10]}]
set_output_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[11]}]
set_output_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[12]}]
set_output_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[13]}]
set_output_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[14]}]
set_output_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[15]}]
set_output_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[16]}]
set_output_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[17]}]
set_output_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[18]}]
set_output_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[19]}]
set_output_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[1]}]
set_output_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[20]}]
set_output_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[21]}]
set_output_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[22]}]
set_output_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[23]}]
set_output_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[24]}]
set_output_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[25]}]
set_output_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[26]}]
set_output_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[27]}]
set_output_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[28]}]
set_output_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[29]}]
set_output_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[2]}]
set_output_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[30]}]
set_output_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[31]}]
set_output_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[3]}]
set_output_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[4]}]
set_output_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[5]}]
set_output_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[6]}]
set_output_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[7]}]
set_output_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[8]}]
set_output_delay -min 0.50   -clock [get_clocks {clk}] [get_ports {wbs_dat_o[9]}]

# Output loads
set_load 0.14  [get_ports {wbs_ack_o}]
set_load 0.14  [get_ports {wbs_dat_o[0]}]
set_load 0.14  [get_ports {wbs_dat_o[10]}]
set_load 0.14  [get_ports {wbs_dat_o[11]}]
set_load 0.14  [get_ports {wbs_dat_o[12]}]
set_load 0.14  [get_ports {wbs_dat_o[13]}]
set_load 0.14  [get_ports {wbs_dat_o[14]}]
set_load 0.14  [get_ports {wbs_dat_o[15]}]
set_load 0.14  [get_ports {wbs_dat_o[16]}]
set_load 0.14  [get_ports {wbs_dat_o[17]}]
set_load 0.14  [get_ports {wbs_dat_o[18]}]
set_load 0.14  [get_ports {wbs_dat_o[19]}]
set_load 0.14  [get_ports {wbs_dat_o[1]}]
set_load 0.14  [get_ports {wbs_dat_o[20]}]
set_load 0.14  [get_ports {wbs_dat_o[21]}]
set_load 0.14  [get_ports {wbs_dat_o[22]}]
set_load 0.14  [get_ports {wbs_dat_o[23]}]
set_load 0.14  [get_ports {wbs_dat_o[24]}]
set_load 0.14  [get_ports {wbs_dat_o[25]}]
set_load 0.14  [get_ports {wbs_dat_o[26]}]
set_load 0.14  [get_ports {wbs_dat_o[27]}]
set_load 0.14  [get_ports {wbs_dat_o[28]}]
set_load 0.14  [get_ports {wbs_dat_o[29]}]
set_load 0.14  [get_ports {wbs_dat_o[2]}]
set_load 0.14  [get_ports {wbs_dat_o[30]}]
set_load 0.14  [get_ports {wbs_dat_o[31]}]
set_load 0.14  [get_ports {wbs_dat_o[3]}]
set_load 0.14  [get_ports {wbs_dat_o[4]}]
set_load 0.14  [get_ports {wbs_dat_o[5]}]
set_load 0.14  [get_ports {wbs_dat_o[6]}]
set_load 0.14  [get_ports {wbs_dat_o[7]}]
set_load 0.14  [get_ports {wbs_dat_o[8]}]
set_load 0.14  [get_ports {wbs_dat_o[9]}]
